tap "noahgorstein/tap"
brew "atuin", restart_service: :changed
brew "bat"
brew "bat-extras"
brew "carapace"
brew "doggo"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "git-delta"
brew "helix"
brew "jq"
brew "nushell"
brew "ripgrep"
brew "starship"
brew "stow"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "noahgorstein/tap/jqp"
cask "ngrok"
