tap "noahgorstein/tap"
brew "atuin", restart_service: :changed
brew "bat"
brew "bat-extras"
brew "biome"
brew "carapace"
brew "doggo"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "git-delta"
brew "helix"
brew "jq"
brew "nushell"
brew "pnpm"
brew "ripgrep"
brew "starship"
brew "stow"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "noahgorstein/tap/jqp"
cask "ngrok"
vscode "ardenivanov.svelte-intellisense"
vscode "arrterian.nix-env-selector"
vscode "bbenoist.nix"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "gruntfuggly.todo-tree"
vscode "jnoortheen.nix-ide"
vscode "miguelsolorio.fluent-icons"
vscode "naumovs.color-highlight"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "ziglang.vscode-zig"
