tap "henrygd/beszel"
tap "noahgorstein/tap"
tap "oven-sh/bun"
tap "teamookla/speedtest"
brew "atuin", restart_service: :changed
brew "bat"
brew "bat-extras"
brew "biome"
brew "block-goose-cli"
brew "btop"
brew "carapace"
brew "cbonsai"
brew "cocoapods"
brew "doggo"
brew "duti"
brew "eza"
brew "fancy-cat"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gemini-cli"
brew "ghq"
brew "git"
brew "git-delta"
brew "glow"
brew "helix"
brew "htop"
brew "jq"
brew "jqp"
brew "mas"
brew "maven"
brew "nping"
brew "nushell"
brew "opencode"
brew "pnpm"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tlrc"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "henrygd/beszel/beszel-agent"
brew "oven-sh/bun/bun"
brew "teamookla/speedtest/speedtest"
cask "expo-orbit"
cask "font-jetbrains-mono-nerd-font"
cask "jordanbaird-ice"
cask "ngrok"
cask "only-switch"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "ColorSlurp", id: 1287239339
mas "Copilot", id: 1447330651
mas "Flighty", id: 1358823008
mas "Folder Quick Look", id: 6753110395
mas "HEIC Converter", id: 1294126402
mas "Shareful", id: 1522267256
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "ardenivanov.svelte-intellisense"
vscode "arrterian.nix-env-selector"
vscode "bbenoist.nix"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "gruntfuggly.todo-tree"
vscode "jnoortheen.nix-ide"
vscode "miguelsolorio.fluent-icons"
vscode "naumovs.color-highlight"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "ziglang.vscode-zig"
